___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:120%; text-align:center; border-radius:10px 10px;">Way to Reinvent Yourself</p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 10</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Working with Text & Time Data</p>

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [WORKING WITH TEXT DATA](#0)
* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#00)
* [WORKING WITH TIME DATA](#1)
    * [String Methods](#1.1)
    * [Most Usefull String Methods](#1.2)
    * [Dummy Operations](#1.3)
* [WORKING WITH TIME DATA](#2)
    * [pd.to_datetime()](#2.1)
    * [Series.dt()](#2.2)
    * [Datetime Module](#2.3)
    * [Series.dt()](#2.4)
* [OPERATION WITH DATETIME OBJECT](#3)
* [THE END OF THE SESSION](#4)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="00"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Working with Text Data</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In this notebook, we will first discuss the string operations with our basic Series/Index and learn how to apply these string functions on the DataFrame.

Pandas provides a set of string functions which make it easy to operate on string data. Most importantly, these functions ignore (or exclude) missing/NaN values. Almost, all of these methods work with Python string functions [Refer To Official Python Documentation]( https://docs.python.org/3/library/stdtypes.html#string-methods). So, while studying with the Series Object, convert it to String Object and then perform the operation.

In addition, according to [Pandas Official Document](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html), there are two ways to store text data in pandas:
- object -dtype NumPy array.
- StringDtype extension type.

Pandas recommend using StringDtype to store text data.

[SOURCE01](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html), [SOURCE02](https://www.w3schools.com/python/python_ref_string.asp)

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">String Methods</p>

<a id="1.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Strings implement all of the common sequence operations, along with the additional methods described at [the official documentation](https://docs.python.org/3/library/stdtypes.html#string-methods).

Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (**Please see the information about** [str.format()](https://docs.python.org/3/library/stdtypes.html#str.format), [Format String Syntax](https://docs.python.org/3/library/string.html#formatstrings) and [Custom String Formatting](https://docs.python.org/3/library/string.html#string-formatting)) and the other based on C printf style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle ([printf-style String Formatting](https://docs.python.org/3/library/stdtypes.html#old-string-formatting)).

The [Text Processing Services](https://docs.python.org/3/library/text.html#textservices) section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the [re](https://docs.python.org/3/library/re.html#module-re) module).

Please watch [**``Video Source``**](https://www.youtube.com/watch?v=6JNwK6hEneg) for enhancing your understanding of working with Text Data in Pandas.  

**What are these String Methods? Now let us examine some of the most common and usefull String Methods and dig into them one by one:**

In [2]:
df = pd.read_excel("text_exercise.xlsx")
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Most Usefull String Methods</p>

<a id="1.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

- **str.lower() =>** Converts a string into lower case
- **str.upper() =>** Converts a string into upper case
- **str.capitalize() =>** Converts the first character to upper case
- **str.title() =>** Converts the first character of each word to upper case
- **str.swapcase() =>** Swaps the case lower/upper

[SOURCE01](https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm)
[SOURCE02](https://www.aboutdatablog.com/post/10-most-useful-string-functions-in-pandas)
[SOURCE03](https://towardsdatascience.com/5-must-know-pandas-operations-on-strings-4f88ca6b8e25)
[SOURCE04](https://towardsdatascience.com/pandas-string-operations-explained-fdfab7602fb4)
[SOURCE05](https://blog.devgenius.io/string-operations-on-pandas-dataframe-88af220439d1)
[SOURCE06](https://www.geeksforgeeks.org/string-manipulations-in-pandas-dataframe/)

___

In [5]:
df["staff"].str.lower()

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smi̇th
6      adrian star
7     albert simon
Name: staff, dtype: object

In [6]:
df["staff"].str.upper()

0         TOM BLUE
1       JOHN BLACK
2    MICHEAL BROWN
3     JASON WALKER
4       ALEX GREEN
5      OSCAR SMİTH
6      ADRIAN STAR
7     ALBERT SIMON
Name: staff, dtype: object

In [7]:
df.staff.str.title()

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar Smi̇th
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

In [8]:
df.staff.str.capitalize()

0         Tom blue
1       John black
2    Micheal brown
3     Jason walker
4       Alex green
5     Oscar smi̇th
6      Adrian star
7     Albert simon
Name: staff, dtype: object

___

- **str.isalpha()     =>** Returns True if all characters in the string are in the alphabet
- **str.isnumeric()   =>** Returns True if all characters in the string are numeric
- **str.isalnum()     =>** Returns True if all characters in the string are alphanumeric
- **str.endswith()	  =>** Returns true if the string ends with the specified value
- **str.startswith()  =>** Returns true if the string starts with the specified value
- **str.contains()	  =>** Returns a Boolean value True for each element if the substring contains in the element, else False.

[SOURCE01](https://careerkarma.com/blog/python-isalpha-isnumeric-isalnum/)
[SOURCE02](https://careerkarma.com/blog/python-startswith-and-endswith/)
[SOURCE03](https://www.geeksforgeeks.org/python-startswith-endswidth-function/)
[SOURCE04](https://towardsdatascience.com/check-for-a-substring-in-a-pandas-dataframe-column-4b949f64852#:~:text=The%20contains%20method%20in%20Pandas,str.)

___

In [9]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

**isalpha()** Function in pandas python checks whether the string consists of alphabetic characters only. It returns True when alphabetic value is present and it returns False when the alphabetic value is not present.

In [10]:
df.job.str.isalpha()

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: job, dtype: bool

In [11]:
df[df.job.str.isalpha()]

      id         staff department        job       salary age
0  M0001      Tom BLUE         HR    manager   "$150,000"  52
1  M0002    JOHN BLACK         IT    manager   "$180,000"  48
3  E0002  jason walker         HR  recruiter  130000dolar  38

**isnumeric()** checks whether all characters in each string are numeric. This is equivalent to running the Python string method str. isnumeric() for each element of the Series/Index.

In [14]:
df.age

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object

In [12]:
df.age.str.isnumeric()

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

In [13]:
df.age.astype('str').str.isnumeric()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
Name: age, dtype: bool

In [17]:
df[df.age.astype(str).str.isnumeric()]

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [18]:
df.loc[df.age.astype(str).str.isnumeric()]

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

**isalnum()** Function in python checks whether the string consists of alphanumeric characters. It returns True when alphanumeric value is present and it returns False when the alphanumeric value is not present. Alphanumeric means a character that is either a letter or a number.

In [19]:
df.salary.str.isalnum()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

In [20]:
df.loc[df.salary.str.isalnum()]

      id         staff department             job       salary age
3  E0002  jason walker         HR       recruiter  130000dolar  38
7  E0006  Albert simon         IT  data scientist  125000dolar  35

Pandas **startswith()** tests if the start of each string element matches a pattern. It is yet another method to search and filter text data in Series or Data Frame. This method is Similar to Python’s startswith() method, but has different parameters and it works on Pandas objects only. Hence .str has to be prefixed everytime before calling this method, so that the compiler knows that it’s different from default function.

In [21]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [22]:
df.job.str.startswith("m")

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
Name: job, dtype: bool

In [24]:
df.loc[df.job.str.startswith("m")]

      id       staff department      job      salary age
0  M0001    Tom BLUE         HR  manager  "$150,000"  52
1  M0002  JOHN BLACK         IT  manager  "$180,000"  48

Pandas **endswith()** method is a built-in function that determines whether the given string ends with a specific sequence of characters.

In [25]:
df.job.str.endswith('per')

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

In [26]:
df.loc[df.job.str.endswith('per')]

      id        staff department                 job      salary age
4  E0003   Alex Green         IT   backend developer  "$110,000"   -
5  E0004  OSCAR SMİTH         IT  frontend developer  "$120,000"  32

The **contains()** method in Pandas allows you to search a column for a specific substring. The contains method returns boolean values for the Series with True for if the original Series value contains the substring and False if not [SOURCE](https://towardsdatascience.com/check-for-a-substring-in-a-pandas-dataframe-column-4b949f64852#:~:text=The%20contains%20method%20in%20Pandas,str.).

In [27]:
df.job.str.contains("end")

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

In [29]:
df.loc[df.job.str.contains("end")]

      id        staff department                 job      salary age
4  E0003   Alex Green         IT   backend developer  "$110,000"   -
5  E0004  OSCAR SMİTH         IT  frontend developer  "$120,000"  32

we can use these string methods which returning boolean expression for creating condition and so selecting relative rows

In [31]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [30]:
df.loc[df.job.str.contains("data"), "department"]

2    IT
6    IT
7    IT
Name: department, dtype: object

In [34]:
df.staff.str.lower().str.startswith("a")

0    False
1    False
2    False
3    False
4     True
5    False
6     True
7     True
Name: staff, dtype: bool

In [45]:
df.loc[df.staff.str.lower().str.startswith("a"), ["salary", "age"]]

        salary age
4   "$110,000"   -
6   "$135,000"  40
7  125000dolar  35

In [46]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [47]:
df.loc[(df.staff.str.lower().str.startswith("a")) & (df.job == "data scientist"),["salary","department"]]

        salary department
6   "$135,000"         IT
7  125000dolar         IT

In [48]:
df.loc[(df.staff.str.lower().str.startswith("a")) & (df.job == "data scientist")][["salary","department"]]

        salary department
6   "$135,000"         IT
7  125000dolar         IT

In [49]:
df[["salary", "department"]].loc[(df.staff.str.lower().str.startswith("a")) & (df.job == "data scientist")]

        salary department
6   "$135,000"         IT
7  125000dolar         IT

In [35]:
df.loc[df.staff.str.lower().str.startswith("a")]["salary"]

4     "$110,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

In [36]:
df.loc[df.staff.str.lower().str.startswith("a")].salary

4     "$110,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

In [39]:
df.loc[df.staff.str.lower().str.startswith("a")][['salary']]

        salary
4   "$110,000"
6   "$135,000"
7  125000dolar

In [42]:
df.loc[df.staff.str.lower().str.startswith("a"), ["salary"]]

        salary
4   "$110,000"
6   "$135,000"
7  125000dolar

___

- **str.strip()	=>** Returns a trimmed version of the string

- **str.replace() =>** Returns a string where a specified value is replaced with a specified value

- **str.split()	=>** Splits the string at the specified separator, and returns a list

- **str.find()	=>** Searches the string for a specified value and returns the position of where it was found

- **str.findall()	=>** Returns a list of all occurrence of the pattern.

- **str.join()	=>** Converts the elements of an iterable into a string

___

**NOTE:** For a better using and understanding of strip, please revise escape characters in python [Source01 for Escape Characters](https://www.python-ds.com/python-3-escape-sequences) & [Source02 for Escape Characters](https://www.w3schools.com/python/gloss_python_escape_characters.asp)

In [50]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [51]:
df.salary.str.strip("\"")

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

In [52]:
df.salary.str.strip("\"").str.strip("$")

0        150,000
1        180,000
2        150,000
3    130000dolar
4        110,000
5        120,000
6        135,000
7    125000dolar
Name: salary, dtype: object

In [53]:
df.salary.str.strip("\"").str.strip("$").str.strip("dolar")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [54]:
df.salary.str.strip("\"dolar$")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [55]:
df.salary.str.strip("\"dolar$").str.replace(",", "")

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: object

In [57]:
df.salary.str.strip("\"dolar$").str.replace(",", "").astype(float)

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

In [58]:
df["salary"] = df.salary.str.strip("\"dolar$").str.replace(",", "").astype(float)
df.salary

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      float64
 5   age         8 non-null      object
dtypes: float64(1), object(5)
memory usage: 512.0+ bytes

In [60]:
df

      id          staff department                 job    salary age
0  M0001       Tom BLUE         HR             manager  150000.0  52
1  M0002     JOHN BLACK         IT             manager  180000.0  48
2  E0001  Micheal Brown         IT      data scientist  150000.0  35
3  E0002   jason walker         HR           recruiter  130000.0  38
4  E0003     Alex Green         IT   backend developer  110000.0   -
5  E0004    OSCAR SMİTH         IT  frontend developer  120000.0  32
6  E0005    Adrian STAR         IT      data scientist  135000.0  40
7  E0006   Albert simon         IT      data scientist  125000.0  35

In [67]:
df = pd.read_excel("text_exercise.xlsx")
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [68]:
df.salary.transform(lambda x: "".join([i for i in x if i.isdigit()]))

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: object

In [69]:
df.salary.transform(lambda x: "".join([i for i in x if i.isdigit()])).astype(int)

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: int32

In [70]:
df["salary"] = df.salary.transform(lambda x: "".join([i for i in x if i.isdigit()])).astype(int)

In [71]:
df

      id          staff department                 job  salary age
0  M0001       Tom BLUE         HR             manager  150000  52
1  M0002     JOHN BLACK         IT             manager  180000  48
2  E0001  Micheal Brown         IT      data scientist  150000  35
3  E0002   jason walker         HR           recruiter  130000  38
4  E0003     Alex Green         IT   backend developer  110000   -
5  E0004    OSCAR SMİTH         IT  frontend developer  120000  32
6  E0005    Adrian STAR         IT      data scientist  135000  40
7  E0006   Albert simon         IT      data scientist  125000  35

In [72]:
type(df["age"][0])

int

In [81]:
df.age.astype('str').transform(lambda x: "".join([i for i in x if i.isdigit()]))[4]

''

In [85]:
type(df.age.astype('str').transform(lambda x: "".join([i for i in x if i.isdigit()]))[4])

str

In [89]:
df.age.astype('str').transform(lambda x: "".join([i for i in x if i.isdigit()])).replace("", np.nan).astype(float)

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

### ``str.replace()`` vs **``.replace()``

- **Purpose:** Use **str.replace** for substring replacements on a single string column, and **replace** for any general replacement on one or more columns.

- **Usage:** **str.replace** can replace one thing at a time. **replace** lets you perform multiple independent replacements, i.e., replace many things at once.

- **Default behavior:** **str.replace** enables regex replacement by default. **replace** only performs a full match unless the regex=True switch is used.

**Indexing with .str[]** 

You can use [] notation to directly index by position locations [SOURCE](https://pandas.pydata.org/pandas-docs/version/0.15/text.html).

In [90]:
df.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMİTH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [91]:
df.staff.str.title().str.split()

0         [Tom, Blue]
1       [John, Black]
2    [Micheal, Brown]
3     [Jason, Walker]
4       [Alex, Green]
5     [Oscar, Smi̇th]
6      [Adrian, Star]
7     [Albert, Simon]
Name: staff, dtype: object

In [92]:
df.staff.str.title().str.split().str[0]

0        Tom
1       John
2    Micheal
3      Jason
4       Alex
5      Oscar
6     Adrian
7     Albert
Name: staff, dtype: object

In [93]:
df["first_name"] = df.staff.str.title().str.split().str[0]
df["last_name"] = df.staff.str.title().str.split().str[1]
df.drop("staff", axis=1, inplace=True)
df

      id department                 job  salary age first_name last_name
0  M0001         HR             manager  150000  52        Tom      Blue
1  M0002         IT             manager  180000  48       John     Black
2  E0001         IT      data scientist  150000  35    Micheal     Brown
3  E0002         HR           recruiter  130000  38      Jason    Walker
4  E0003         IT   backend developer  110000   -       Alex     Green
5  E0004         IT  frontend developer  120000  32      Oscar    Smi̇th
6  E0005         IT      data scientist  135000  40     Adrian      Star
7  E0006         IT      data scientist  125000  35     Albert     Simon

In [94]:
df = df[["first_name", "last_name", "id", "department", "job", "salary", "age"]]
df

  first_name last_name     id department                 job  salary age
0        Tom      Blue  M0001         HR             manager  150000  52
1       John     Black  M0002         IT             manager  180000  48
2    Micheal     Brown  E0001         IT      data scientist  150000  35
3      Jason    Walker  E0002         HR           recruiter  130000  38
4       Alex     Green  E0003         IT   backend developer  110000   -
5      Oscar    Smi̇th  E0004         IT  frontend developer  120000  32
6     Adrian      Star  E0005         IT      data scientist  135000  40
7     Albert     Simon  E0006         IT      data scientist  125000  35

**str.find** returns lowest indexes in each strings in the Series/Index. Each of returned indexes corresponds to the position where the substring is fully contained between [start:end]. Return -1 on failure. Equivalent to standard str.find().

**str.rfind** returns highest indexes in each strings in the Series/Index. Each of returned indexes corresponds to the position where the substring is fully contained between [start:end]. Return -1 on failure. Equivalent to standard str.rfind().

In [95]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [96]:
df.job.str.find("developer")

0   -1
1   -1
2   -1
3   -1
4    8
5    9
6   -1
7   -1
Name: job, dtype: int64

**str.findall** finds all occurrences of pattern or regular expression in the Series/Index [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.findall.html).

In [100]:
df.job.str.findall("developer")

0             []
1             []
2             []
3             []
4    [developer]
5    [developer]
6             []
7             []
Name: job, dtype: object

In [98]:
df["skills"] = [[],["Java","C++"],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df["Skills"] = [[],[],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df.loc[1, "Skills"] = "Java,C++"
df

C:\Users\hatic\AppData\Local\Temp/ipykernel_10284/1372786985.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["skills"] = [[],["Java","C++"],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
C:\Users\hatic\AppData\Local\Temp/ipykernel_10284/1372786985.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Skills"] = [[],[],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
C:\Users\hatic\anaconda3\lib\site-packages\pandas\core\indexing.py:1817: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,first_name,last_name,id,department,job,salary,age,skills,Skills
0,Tom,Blue,M0001,HR,manager,150000,52,[],[]
1,John,Black,M0002,IT,manager,180000,48,"[Java, C++]","Java,C++"
2,Micheal,Brown,E0001,IT,data scientist,150000,35,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,Jason,Walker,E0002,HR,recruiter,130000,38,[],[]
4,Alex,Green,E0003,IT,backend developer,110000,-,"[React, Django]","[React, Django]"
5,Oscar,Smi̇th,E0004,IT,frontend developer,120000,32,"[JavaScript, Python]","[JavaScript, Python]"
6,Adrian,Star,E0005,IT,data scientist,135000,40,"[R, SQL]","[R, SQL]"
7,Albert,Simon,E0006,IT,data scientist,125000,35,"[SQL, Python]","[SQL, Python]"

If the elements of a Series are lists themselves, join the content of these lists using the delimiter passed to the function. This function is an equivalent to str.join() [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.join.html).

**Join** lists contained as elements in the Series/Index with passed delimiter.

In [101]:
df.skills.str.join(",")

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: skills, dtype: object

In [102]:
df.Skills.str.join(",")

0
1       J,a,v,a,,,C,+,+
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [104]:
df.Skills.apply(lambda item: ",".join(item) if type(item) == list else item)

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [105]:
df

,first_name,last_name,id,department,job,salary,age,skills,Skills
0,Tom,Blue,M0001,HR,manager,150000,52,[],[]
1,John,Black,M0002,IT,manager,180000,48,"[Java, C++]","Java,C++"
2,Micheal,Brown,E0001,IT,data scientist,150000,35,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,Jason,Walker,E0002,HR,recruiter,130000,38,[],[]
4,Alex,Green,E0003,IT,backend developer,110000,-,"[React, Django]","[React, Django]"
5,Oscar,Smi̇th,E0004,IT,frontend developer,120000,32,"[JavaScript, Python]","[JavaScript, Python]"
6,Adrian,Star,E0005,IT,data scientist,135000,40,"[R, SQL]","[R, SQL]"
7,Albert,Simon,E0006,IT,data scientist,125000,35,"[SQL, Python]","[SQL, Python]"

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Dummy Operations</p>

<a id="1.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A dataset may contain various type of values, sometimes it consists of categorical values. So, in-order to use those categorical value for programming efficiently we create dummy variables. A dummy variable is a binary variable that indicates whether a separate categorical variable takes on a specific value [SOURCE](https://www.geeksforgeeks.org/how-to-create-dummy-variables-in-python-with-pandas/).

### get_dummies()

**Syntax1:** ``pd.get_dummies(data, prefix=None, prefix_sep="_",)``<br>
            **OR**<br>
**Syntax2:** ``df["col_name"].get_dummies(sep = ",")``

**Parameters:**
- data= input data i.e. it includes pandas data frame. list . set . numpy arrays etc.
- prefix= Initial value
- prefix_sep= Data values separation.
- Return Type: Dummy variables.

In [106]:
df

,first_name,last_name,id,department,job,salary,age,skills,Skills
0,Tom,Blue,M0001,HR,manager,150000,52,[],[]
1,John,Black,M0002,IT,manager,180000,48,"[Java, C++]","Java,C++"
2,Micheal,Brown,E0001,IT,data scientist,150000,35,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,Jason,Walker,E0002,HR,recruiter,130000,38,[],[]
4,Alex,Green,E0003,IT,backend developer,110000,-,"[React, Django]","[React, Django]"
5,Oscar,Smi̇th,E0004,IT,frontend developer,120000,32,"[JavaScript, Python]","[JavaScript, Python]"
6,Adrian,Star,E0005,IT,data scientist,135000,40,"[R, SQL]","[R, SQL]"
7,Albert,Simon,E0006,IT,data scientist,125000,35,"[SQL, Python]","[SQL, Python]"

In [107]:
pd.get_dummies(df.department)

   HR  IT
0   1   0
1   0   1
2   0   1
3   1   0
4   0   1
5   0   1
6   0   1
7   0   1

As you can see two(2) dummy variables are created for the three categorical values of the "department" attribute. We can create dummy variables in python using **``get_dummies()``** method.

Dummies with **``drop_first=True``** parameter can be used to drop the first column. drop_first=True is important to use, as it helps in reducing the extra column created during dummy variable creation. Hence it reduces the correlations created among dummy variables. In other words it drops the first dummy to avoid the creation of correlated features [SOURCE](https://stackoverflow.com/questions/63661560/drop-first-true-during-dummy-variable-creation-in-pandas#:~:text=1%20Answer,correlations%20created%20among%20dummy%20variables.).

In [108]:
pd.get_dummies(df.department, drop_first=True)

   IT
0   0
1   1
2   1
3   0
4   1
5   1
6   1
7   1

In [109]:
df

,first_name,last_name,id,department,job,salary,age,skills,Skills
0,Tom,Blue,M0001,HR,manager,150000,52,[],[]
1,John,Black,M0002,IT,manager,180000,48,"[Java, C++]","Java,C++"
2,Micheal,Brown,E0001,IT,data scientist,150000,35,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,Jason,Walker,E0002,HR,recruiter,130000,38,[],[]
4,Alex,Green,E0003,IT,backend developer,110000,-,"[React, Django]","[React, Django]"
5,Oscar,Smi̇th,E0004,IT,frontend developer,120000,32,"[JavaScript, Python]","[JavaScript, Python]"
6,Adrian,Star,E0005,IT,data scientist,135000,40,"[R, SQL]","[R, SQL]"
7,Albert,Simon,E0006,IT,data scientist,125000,35,"[SQL, Python]","[SQL, Python]"

In [114]:
df.skills

0                        []
1               [Java, C++]
2    [Python, Tableau, SQL]
3                        []
4           [React, Django]
5      [JavaScript, Python]
6                  [R, SQL]
7             [SQL, Python]
Name: skills, dtype: object

In [115]:
df.skills.str.get_dummies(sep=",")

,'C++'],'Django'],'Python'],'SQL'],'Tableau',['Java',['JavaScript',['Python',['R',['React',['SQL',[]
0,0,0,0,0,0,0,0,0,0,0,0,1
1,1,0,0,0,0,1,0,0,0,0,0,0
2,0,0,0,1,1,0,0,1,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,0,1
4,0,1,0,0,0,0,0,0,0,1,0,0
5,0,0,1,0,0,0,1,0,0,0,0,0
6,0,0,0,1,0,0,0,0,1,0,0,0
7,0,0,1,0,0,0,0,0,0,0,1,0

In [113]:
df.Skills.str.get_dummies(sep=",").add_prefix("Skills_")

,Skills_ 'Django'],Skills_ 'Python'],Skills_ 'SQL'],Skills_ 'Tableau',Skills_C++,Skills_Java,Skills_['JavaScript',Skills_['Python',Skills_['R',Skills_['React',Skills_['SQL',Skills_[]
0,0,0,0,0,0,0,0,0,0,0,0,1
1,0,0,0,0,1,1,0,0,0,0,0,0
2,0,0,1,1,0,0,0,1,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,0,1
4,1,0,0,0,0,0,0,0,0,1,0,0
5,0,1,0,0,0,0,1,0,0,0,0,0
6,0,0,1,0,0,0,0,0,1,0,0,0
7,0,1,0,0,0,0,0,0,0,0,1,0

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Working with Time Data</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

As someone who works with time series data on almost a daily basis, it's clear that the pandas Python package is extremely useful for time series manipulation and analysis. This basic introduction to time series data manipulation with pandas should allow you to get started in your time series analysis. Specific objectives are to show you how to:
- create a date range
- work with timestamp data
- convert string data to a timestamp
- index and slice your time series data in a data frame
- resample your time series for different time period aggregates/summary statistics
- compute a rolling statistic such as a rolling average
- work with missing data
- understand the basics of unix/epoch time
- understand common pitfalls of time series data analysis [SOURCE](https://towardsdatascience.com/basic-time-series-manipulation-with-pandas-4432afee64ea)

In this section, we will introduce how to work with each of these types of date/time data in Pandas. This short section is by no means a complete guide to the time series tools available in Python or Pandas, but instead is intended as a broad overview of how you as a user should approach working with time series [SOURCE](https://jakevdp.github.io/PythonDataScienceHandbook/03.11-working-with-time-series.html).

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">pd.to_datetime()</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

For more and detailed information about to_datetime() metod, please [Visit Official Document](https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html)

**``pd.to_datetime()``** Converts argument to datetime.

This function converts a **``scalar``**, **``array-like``**, **``Series``** or **``DataFrame/dict-like``** to a pandas datetime object.

**As stated above, many input types are supported, and lead to different output types:**

- **``scalars``** can be int, float, str, datetime object (from stdlib datetime module or numpy). They are converted to Timestamp when possible, otherwise they are converted to datetime.datetime. None/NaN/null scalars are converted to NaT.

- **``array-like``** can contain int, float, str, datetime objects. They are converted to DatetimeIndex when possible, otherwise they are converted to Index with object dtype, containing datetime.datetime. None/NaN/null entries are converted to NaT in both cases.

- **``Series``** are converted to Series with datetime64 dtype when possible, otherwise they are converted to Series with object dtype, containing datetime.datetime. None/NaN/null entries are converted to NaT in both cases.

- **``DataFrame/dict-like``** are converted to Series with datetime64 dtype. For each row a datetime is created from assembling the various dataframe columns. Column keys can be common abbreviations like [‘year’, ‘month’, ‘day’, ‘minute’, ‘second’, ‘ms’, ‘us’, ‘ns’]) or plurals of the same.

[Special Note :](https://pandas.pydata.org/docs/getting_started/intro_tutorials/09_timeseries.html)

As many data sets do contain datetime information in one of the columns, pandas input function like [pandas.read_csv()](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html#pandas.read_csv) and [pandas.read_json()](https://pandas.pydata.org/docs/reference/api/pandas.read_json.html#pandas.read_json) can do the transformation to dates when reading the data using the **``parse_dates parameter``** with a list of the columns to read as Timestamp.

Why are these **``pandas.Timestamp``** objects useful? Let's illustrate the added value with some example cases. In this sense, let us assume that we want to work with the dates in the column datetime as datetime objects instead of plain text:

In [116]:
df = pd.read_csv("time_exercise.csv")
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

In [117]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

In [118]:
df["order_date"]

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

Initially, the values in datetime are character strings and do **NOT** provide any datetime operations (e.g. extract the year, day of the week,…). By applying the to_datetime function, pandas interprets the strings and convert these to datetime (i.e. ``datetime64[ns, UTC]``) objects. In pandas we call these datetime objects similar to datetime.datetime from the standard library as [pandas.Timestamp](https://pandas.pydata.org/docs/reference/api/pandas.Timestamp.html#pandas.Timestamp).

In [119]:
pd.to_datetime(df["order_date"])

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

In [120]:
df["entry_date"] = pd.to_datetime(df["entry_date"])
df["order_date"] = pd.to_datetime(df["order_date"])

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 35.7 KB

In [122]:
df.entry_date.min()

Timestamp('2018-12-04 00:00:00')

In [123]:
df.entry_date.max()

Timestamp('2020-11-26 00:00:00')

Now let's apply some aggregate methods for Datatime object at the given dataset:

In [124]:
df.entry_date.max() - df.entry_date.min()

Timedelta('723 days 00:00:00')

In [125]:
a = pd.Series(["15-03-2020", "18-05-2019", "24-07-2018"])
a

0    15-03-2020
1    18-05-2019
2    24-07-2018
dtype: object

In [126]:
a.max()

'24-07-2018'

In [128]:
a.min()

'15-03-2020'

In [127]:
pd.to_datetime(a, format="%d-%m-%Y")

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Series.dt()</p>

<a id="2.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Accessor object for datetimelike properties of the Series values [SOURCE](https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html).

For a comprehensive information what the datetimelike properties, please visit [Official Pandas API Reference Document](https://pandas.pydata.org/pandas-docs/version/0.22/api.html#datetimelike-properties)

In [130]:
df.entry_date.dt.year

0      2018
1      2018
2      2018
3      2018
4      2018
       ...
906    2020
907    2020
908    2020
909    2020
910    2020
Name: entry_date, Length: 911, dtype: int64

In [131]:
df.entry_date.dt.quarter

0      4
1      4
2      4
3      4
4      4
      ..
906    4
907    4
908    4
909    4
910    4
Name: entry_date, Length: 911, dtype: int64

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Datetime Module</p>

<a id="2.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

The datetime module supplies classes for manipulating dates and times [SOURCE](https://docs.python.org/3/library/datetime.html).

### ``class datetime.datetime``

A combination of a date and a time. Attributes: year, month, day, hour, minute, second, microsecond, and tzinfo.

In [132]:
from datetime import datetime

In [133]:
datetime.now()

datetime.datetime(2022, 5, 12, 13, 21, 31, 553076)

In [134]:
print(datetime.now())

2022-05-12 13:21:41.353999

In [135]:
print(datetime.today())

2022-05-12 13:21:54.425584

In [136]:
current = datetime.now()

In [137]:
current.date()

datetime.date(2022, 5, 12)

In [139]:
current.year

2022

In [140]:
current.weekday()

3

In [141]:
current.isoweekday()

4

### ``class datetime.timedelta``

A duration expressing the difference between two date, time, or datetime instances to microsecond resolution [SOURCE](https://www.geeksforgeeks.org/manipulate-date-and-time-with-the-datetime-module-in-python/).

In [142]:
from datetime import timedelta

In [143]:
timedelta(days=2)

datetime.timedelta(days=2)

In [144]:
print(timedelta(days=2))

2 days, 0:00:00

In [145]:
current

datetime.datetime(2022, 5, 12, 13, 23, 34, 153657)

In [146]:
three_days_before = current - timedelta(days=3)
three_days_before

datetime.datetime(2022, 5, 9, 13, 23, 34, 153657)

In [147]:
print(three_days_before)

2022-05-09 13:23:34.153657

In [148]:
current + timedelta(days=3, hours=2, minutes=25)

datetime.datetime(2022, 5, 15, 15, 48, 34, 153657)

In [149]:
print(current + timedelta(days=3, hours=2, minutes=25))

2022-05-15 15:48:34.153657

### ``strftime()``

**Converting** from date/datetime/timedelta object **to string type** [SOURCE](https://strftime.org/)

In [150]:
current

datetime.datetime(2022, 5, 12, 13, 23, 34, 153657)

In [152]:
current.year

2022

In [151]:
current.strftime("%Y")

'2022'

In [157]:
df["new_date"] = df.order_date.transform(lambda x : x.strftime("%Y/%m"))
df.groupby("new_date")[["product_price"]].sum()

          product_price
new_date
2018/11     1469.950000
2018/12      234.990000
2019/01      349.990000
2019/02     4978.815750
2019/03    13530.191213
2019/04      196.062350
2019/05     5797.480327
2019/06    13393.263608
2019/07    14908.625587
2019/08    14150.932496
2019/09    13014.184708
2019/10    19135.694232
2019/11    30850.605284
2019/12    10454.611623
2020/01    47420.124666
2020/02    36034.957721
2020/03    18605.959704
2020/04    20320.893910
2020/05    29300.610285
2020/06    26434.911593
2020/07    21520.390935
2020/08    22034.284388
2020/09    16648.851478
2020/10    23312.936298
2020/11    51538.618059
2020/12     6512.488440
2021/01    12084.840696
2021/02      230.790000

**Watch out the difference.**

### strptime()

**Converting** from string type **to datetime object**

In [160]:
date_string = "21th of June, 2018"
date_string

'21th of June, 2018'

In [165]:
datetime.strptime(date_string, "%dth of %B, %Y")

datetime.datetime(2018, 6, 21, 0, 0)

In [167]:
pd.to_datetime(date_string)

Timestamp('2018-06-21 00:00:00')

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Operation with Datetime Object</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

## Let's detect the time between first order date and entry date for each product

In [168]:
df

,id_product,order_date,product_quantity,product_price,entry_date,new_date
0,401,2021-01-23,1.0,541.487603,2018-12-04,2021/01
1,416,2020-04-02,1.0,131.181818,2018-12-04,2020/04
2,717,2019-03-10,1.0,2035.488500,2018-12-04,2019/03
3,778,2019-12-27,1.0,335.988000,2018-12-04,2019/12
4,826,2020-02-19,1.0,342.292302,2018-12-04,2020/02
...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,2020/11
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,2020/11
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,2020/11
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,2021/01
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,2020/12

**Let us do it by string methods**

## Let's detect the time between last order date and today for each product

**This time, let us do it by datetime properties**

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:150%; text-align:center; border-radius:10px 10px;">The End of Session - 10</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>